[
  {
    "title": "Ants on Manifolds",
    "date": "2025-02-21T10:00:00",
    "speaker": "Oliver Chubet",
    "venue": "3233 EB II",
    "abstract": "Starting with some counterintuitive results of Cantor and Netto, we will revisit classic results of proximity, continuity, and measures of curves on manifolds. We will then discuss the impact of these results on geometric data structures of the present.",
    "speaker_profile": "https://oliverchubet.github.io/"
  },
  {
    "title": "Algorithmic Approaches to Bar Fight Prevention",
    "date": "2025-02-28T10:00:00",
    "speaker": "Mano Prakash Parthasarathi",
    "venue": "3233 EB II",
    "abstract": "In this talk, I shall state the 'Bar fight prevention' problem, which is nothing but the classical vertex cover problem in graph theory. We start from a naive approach, and progressively develop algorithms through 8 stages of refinement. Also, we explore 2 counterproductive ways, illustrating potential pitfalls to avoid in certain variations of the Bar fight prevention problem. This journey leads us to the realm of Parameterized algorithms, highlighting their significance in tackling practical optimization problems. The talk is self-contained.",
    "speaker_profile": "https://manoprakash6.github.io"
  },
  {
    "title": "Solving linear equations w/o Gaussian elimination",
    "date": "2025-03-07T10:00:00",
    "speaker": "Chin Ho Lee",
    "venue": "3233 EB II",
    "abstract": "Solving systems of linear equations is a fundamental problem, and Gaussian elimination is the standard solution. While there are alternatives for solving linear equations over real numbers, for a long time, Gaussian elimination remained the only known algorithm for solving linear equations modulo 2.  In 2012, Prasad Raghavendra came up with a simple yet ingenious approach for this problem.  In this talk, I will explain how his algorithm works.",
    "speaker_profile": "https://chinholee.github.io"
  },
  {
    "title": "Clique-Based Separators for Geom. Intersection Graphs",
    "date": "2025-03-21T11:00:00",
    "speaker": "Siddharth Sheth",
    "venue": "3233 EB II",
    "abstract": "Clique-based separators are a generalization of separators recently developed by de Berg et al. For certain classes of geometric graphs, these separators can be used to develop sub-exponential time algorithms for NP-complete problems. We will go over their construction, some properties, and use them to solve maximum independent set, dominating set, and q-Coloring.",
    "speaker_profile": "https://www.linkedin.com/in/siddharth-sheth-76153b32/"
  },
  {
    "title": "Maximal Matchings with a Random. Parallel Algorithm",
    "date": "2025-03-28T11:00:00",
    "speaker": "Emma Saarinen",
    "venue": "3233 EB II",
    "abstract": "While the best known greedy and deterministic algorithms for finding maximal matchings on a graph in parallel take polylogarithmic time, Israeli and Itai introduced a randomized algorithm in their 1986 paper “A Fast and Simple Randomized Parallel Algorithm for Maximal Matching” with a running time which is logarithmic in the number of processors (E) (I.e. log|E|). In this talk we will present the core algorithm and results from Israeli and Itai’s paper along with the necessary graph-theoretic and statistical proofs. We will discuss potential adaptation or extension of the algorithm to bipartite settings.",
    "speaker_profile": "https://ncsu-theory-lab.github.io/"
  }
]
